demo/InterFSIFOAM-Spring/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolver    solidBody;

solidBodyMotionFunction coupled6DoFMotion;
//CofG            (0.6862 -1.5668  0.2138);
//CofG            (0.66909 -1.5426 0.0368 );
CofG            (0 0 0 );

timeDataFileName "<constant>/6DoF_Trans-3S.dat";

//translationRotation table;
//file "$FOAM_CASE/constant/6DoF_Trans-3S.dat";

// ************************************************************************* //
