demo/InterFSIFOAM-Spring/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,U)    Gauss linearUpwind  cellLimited   leastSquares 1;
    div(phi,k)      Gauss limitedLinear 1;
    div(rhoPhi,k)      Gauss limitedLinear 1;
    div(phi,epsilon)      Gauss limitedLinear 1;
    div(rhoPhi,epsilon)      Gauss limitedLinear 1;
    div(phi,omega)      Gauss limitedLinear 1;
    div(rhoPhi,omega)      Gauss limitedLinear 1;
    div(phi,B)      Gauss limitedLinear 1;
    div(B)          Gauss linear;
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
    div(phi,nuTilda) Gauss limitedLinear 1;
    div(rhoPhi,U)  Gauss linearUpwind grad(U);
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
