demo/InterFSIFOAM-Spring/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    zoneToCell
    {
        
	name "WaterVolume";
       fieldValues
        (
           volScalarFieldValue alpha.water 1
       );
   }

 //    boxToCell
 //    {
    //     box (0.01 0 -100) (0.02 .0 100);
 //        fieldValues
 //        (
 //            volScalarFieldValue alpha.water 1
 //        );
 //    }
);


// ************************************************************************* //
